let value = true
value = 'str'
value = null
value = false
console.log(typeof value) 

 ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// /////

let str = '123'
let num = Number(str)
let object = String('asd')
console.log(typeof num)
console.log(typeof object)

 ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// /////

let userAge = 26
let userName = 'Илья'
let most = `${userName } + ${userAge}`
console.log(most)

 ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// /////

let userAge = 'привет'
userAge = Number(userAge);
console.log(userAge)

 ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// /////

let number = (+'20' + 40, + 20 + 20)
console.log('сорок ' + number); 

 ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// /////

let userName = ''
let userNickName = 'фрилансер'
let user = userName || 'Без имени' || userNickName 
console.log(user)

 ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// ///// /////

let value = 5
let number = 10
number >  value || value++
console.log(value)
